In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
df = pd.read_csv('./homeprices.csv')

In [4]:
df.head()

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [5]:
mean=df['bedrooms'].mean()

In [7]:
mean

4.2

In [9]:
df['bedrooms'].fillna(value=mean, inplace=True)

In [10]:
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.2   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [22]:
y = df.iloc[:,3:4]

In [23]:
y

    price
0  550000
1  565000
2  610000
3  595000
4  760000
5  810000

In [24]:
X=df.iloc[:,:-1]

In [27]:
X

   area  bedrooms  age
0  2600       3.0   20
1  3000       4.0   15
2  3200       4.2   18
3  3600       3.0   30
4  4000       5.0    8
5  4100       6.0    8